/* automatically generated by rust-bindgen 0.69.5 */

pub const OQS_SIG_STFL_alg_xmss_sha256_h10: &[u8; 17] = b"XMSS-SHA2_10_256\0";
pub const OQS_SIG_STFL_alg_xmss_sha256_h16: &[u8; 17] = b"XMSS-SHA2_16_256\0";
pub const OQS_SIG_STFL_alg_xmss_sha256_h20: &[u8; 17] = b"XMSS-SHA2_20_256\0";
pub const OQS_SIG_STFL_alg_xmss_shake128_h10: &[u8; 18] = b"XMSS-SHAKE_10_256\0";
pub const OQS_SIG_STFL_alg_xmss_shake128_h16: &[u8; 18] = b"XMSS-SHAKE_16_256\0";
pub const OQS_SIG_STFL_alg_xmss_shake128_h20: &[u8; 18] = b"XMSS-SHAKE_20_256\0";
pub const OQS_SIG_STFL_alg_xmss_sha512_h10: &[u8; 17] = b"XMSS-SHA2_10_512\0";
pub const OQS_SIG_STFL_alg_xmss_sha512_h16: &[u8; 17] = b"XMSS-SHA2_16_512\0";
pub const OQS_SIG_STFL_alg_xmss_sha512_h20: &[u8; 17] = b"XMSS-SHA2_20_512\0";
pub const OQS_SIG_STFL_alg_xmss_shake256_h10: &[u8; 18] = b"XMSS-SHAKE_10_512\0";
pub const OQS_SIG_STFL_alg_xmss_shake256_h16: &[u8; 18] = b"XMSS-SHAKE_16_512\0";
pub const OQS_SIG_STFL_alg_xmss_shake256_h20: &[u8; 18] = b"XMSS-SHAKE_20_512\0";
pub const OQS_SIG_STFL_alg_xmss_sha256_h10_192: &[u8; 17] = b"XMSS-SHA2_10_192\0";
pub const OQS_SIG_STFL_alg_xmss_sha256_h16_192: &[u8; 17] = b"XMSS-SHA2_16_192\0";
pub const OQS_SIG_STFL_alg_xmss_sha256_h20_192: &[u8; 17] = b"XMSS-SHA2_20_192\0";
pub const OQS_SIG_STFL_alg_xmss_shake256_h10_192: &[u8; 21] = b"XMSS-SHAKE256_10_192\0";
pub const OQS_SIG_STFL_alg_xmss_shake256_h16_192: &[u8; 21] = b"XMSS-SHAKE256_16_192\0";

pub const OQS_SIG_cross_rsdpg_192_small_length_public_key: u32 = 83;
pub const OQS_SIG_cross_rsdpg_192_small_length_secret_key: u32 = 48;
pub const OQS_SIG_cross_rsdpg_192_small_length_signature: u32 = 18188;
pub const OQS_SIG_cross_rsdpg_256_balanced_length_public_key: u32 = 106;
pub const OQS_SIG_cross_rsdpg_256_balanced_length_secret_key: u32 = 64;
pub const OQS_SIG_cross_rsdpg_256_balanced_length_signature: u32 = 40134;
pub const OQS_SIG_cross_rsdpg_256_fast_length_public_key: u32 = 106;
pub const OQS_SIG_cross_rsdpg_256_fast_length_secret_key: u32 = 64;
pub const OQS_SIG_cross_rsdpg_256_fast_length_signature: u32 = 48938;
pub const OQS_SIG_cross_rsdpg_256_small_length_public_key: u32 = 106;
pub const OQS_SIG_cross_rsdpg_256_small_length_secret_key: u32 = 64;
pub const OQS_SIG_cross_rsdpg_256_small_length_signature: u32 = 32742;
extern "C" {
    pub fn OQS_SIG_alg_identifier(i: usize) -> *const ::libc::c_char;
}
extern "C" {
    pub fn OQS_SIG_alg_count() -> ::libc::c_int;
}
extern "C" {
    pub fn OQS_SIG_alg_is_enabled(method_name: *const ::libc::c_char) -> ::libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OQS_SIG {
    pub method_name: *const ::libc::c_char,
    pub alg_version: *const ::libc::c_char,
    pub claimed_nist_level: u8,
    pub euf_cma: bool,
    pub sig_with_ctx_support: bool,
    pub length_public_key: usize,
    pub length_secret_key: usize,
    pub length_signature: usize,
    pub keypair: ::core::option::Option<
        unsafe extern "C" fn(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS,
    >,
    pub sign: ::core::option::Option<
        unsafe extern "C" fn(
            signature: *mut u8,
            signature_len: *mut usize,
            message: *const u8,
            message_len: usize,
            secret_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub sign_with_ctx_str: ::core::option::Option<
        unsafe extern "C" fn(
            signature: *mut u8,
            signature_len: *mut usize,
            message: *const u8,
            message_len: usize,
            ctx_str: *const u8,
            ctx_str_len: usize,
            secret_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub verify: ::core::option::Option<
        unsafe extern "C" fn(
            message: *const u8,
            message_len: usize,
            signature: *const u8,
            signature_len: usize,
            public_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub verify_with_ctx_str: ::core::option::Option<
        unsafe extern "C" fn(
            message: *const u8,
            message_len: usize,
            signature: *const u8,
            signature_len: usize,
            ctx_str: *const u8,
            ctx_str_len: usize,
            public_key: *const u8,
        ) -> OQS_STATUS,
    >,
}
#[test]
fn bindgen_test_layout_OQS_SIG() {
    const UNINIT: ::core::mem::MaybeUninit<OQS_SIG> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<OQS_SIG>(),
        88usize,
        concat!("Size of: ", stringify!(OQS_SIG))
    );
    assert_eq!(
        ::core::mem::align_of::<OQS_SIG>(),
        8usize,
        concat!("Alignment of ", stringify!(OQS_SIG))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).method_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(method_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alg_version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(alg_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).claimed_nist_level) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(claimed_nist_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).euf_cma) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(euf_cma)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sig_with_ctx_support) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(sig_with_ctx_support)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length_public_key) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(length_public_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length_secret_key) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(length_secret_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length_signature) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(length_signature)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keypair) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(keypair)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sign) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sign_with_ctx_str) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(sign_with_ctx_str)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).verify) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(verify)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).verify_with_ctx_str) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(verify_with_ctx_str)
        )
    );
}
extern "C" {
    pub fn OQS_SIG_new(method_name: *const ::libc::c_char) -> *mut OQS_SIG;
}
extern "C" {
    pub fn OQS_SIG_keypair(
        sig: *const OQS_SIG,
        public_key: *mut u8,
        secret_key: *mut u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_sign(
        sig: *const OQS_SIG,
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_sign_with_ctx_str(
        sig: *const OQS_SIG,
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        ctx_str: *const u8,
        ctx_str_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_verify(
        sig: *const OQS_SIG,
